RUN_STRINGS = (
    "ചേച്ചീടെ വാവേ.. 🥰🥰",
    "നീ എന്റെ മുത്തല്ലേടാ..🥰🥰", 
    "മുത്തുമണിയേ എവിട്യാർന്നു...🥰🥰",
    "അച്ചോടാ ചേച്ചിടെ ചക്കര മുത്തേ 🥰🥰",  
    "ചക്കരേന്നാ ആരുടെ ചക്കര കാൾ മീ അമ്മു🤨🤨", 
    "അമ്പട കള്ളാ 🥰🥰😜",
    "ഇവനെന്താ ഇങ്ങനെ തൊട്ടാവാടിയായേ.. 🤨🤨",  
    "ഡായ് അളിയാ കൈച്ചാ നീയ് 🥰🥰",
    "ചുന്ദരി വാവേ 🥰🥰🥰", 
    "അച്ചോടാ വാവേടെ പിണക്കം മാറീല്ല്യേ..? 🥰🥰", 
    "ബാ ചേച്ചി നാരങ്ങാ മിട്ടായി വാങ്ങിത്തരാം 🥰🥰", 
    "ചേച്ചീടെ തക്കുടുമുത്തേ 🥰🥰🥰", 
    "എന്റെ തങ്കകുടമേ... 🥰🥰🥰", 
)

SLAP_SAITAMA_TEMPLATES = (
    "നീ എന്നെ തല്ലാൻ മാത്രം വളർന്നോ 😡😡.",
    "തല്ലെടാ ഒന്ന് തല്ലി നോക്കെടാ 😡.",
    [
        "നിന്റെ വായിൽ ഞാൻ പ്ലാസ്റ്റർ ഒട്ടിക്കും .",  # normal reply
        "പ്ഫാ പന്നെ നിന്നോടല്ലേ പറഞ്ഞേ.. നിർത്തി പോടാ.. 🤧.",  # reply to admin
        "tmute"  # command
    ]
)


SLAP_TEMPLATES = (
    "{user1} {user2}ന്റെ തലക്ക് ഒലക്ക കൊണ്ട് അഞ്ചാറു അടി കൊടുത്തു 😪😪 .",
    "{user1} ചാണകം വാരി {user2}ന്റെ മോന്തക്ക് എറിഞ്ഞു 🤢🤮 .",
    "{user1} ഓടി വന്ന് {user2}ന്റെ തലയിൽ ചീമുട്ടയെറിഞ്ഞു 🤭🤭😜.",
    "{user1} {user2}നെ കാലേ വാരി നിലത്തടിച്ചു 🤓☹️", 
    "{user1} വലിയ പാറക്കല്ലെടുത്തു {user2}ന്റെ തലക്കെറിഞ്ഞു 😱😱🤭 .",
    "{user1} {user2}നെ വിളിച്ചോണ്ട് പോയി പൊട്ടകിണറ്റിൽ തള്ളിയിട്ടു 🤗🤗😝 .",
    "{user1} കാക്കയെ വിളിച്ചു വരുത്തി {user2}ന്റെ തലയിൽ അപ്പിയിടീച്ചു 😝🤣 .",
    "{user1} ഓടി വന്ന് ചൂരൽ കൊണ്ട് {user2}ന്റെ ചന്തിക്കിട്ട് അഞ്ചാറു അടി കൊടുത്ത് 😂😜 .",
    "{user1} {user2}നെ കൊതുകിനെ കൊല്ലുന്ന പോലെ അടിച്ചു കൊന്നു 🤭😜.",
    "{user1} കാന്താരി മുളക് അരച്ചെടുത്തു {user2}ന്റെ കണ്ണിൽ തേച്ചു 🤭🤣.",
    "{user1} {user2}നെ എടുത്തോണ്ട് പോയി ചാണകക്കുഴിയിലിട്ടു 🤣🤣😛.",
    "{user1} പട്ടിയെ അഴിച്ചു വിട്ട് {user2}ന്റെ കാലിൽ കടിപ്പിച്ചു 😂😂😛.",
    "{user1} കട്ടുറുറുമ്പിനെകൊണ്ട് {user2}ന്റെ മൂക്കത്ത് കടിപ്പിച്ചു 🤭🤭😜",
    "{user1} {user2}നെ കോഴിയാണെന്ന് കരുതി കൂട്ടിലടച്ചു 🤭🤭😜", 
)

PING_STRING = (
    "PONG!!",
    "I am here!",
)

ITEMS = (
    "cast iron skillet",
)

THROW = (
    "എറിഞ്ഞു",
)

HIT = (
    "അടിച്ചു",

)

ABUSE_STRINGS = (
    "Fuck off",
)

EYES = [
    ['⌐■', '■'],
    [' ͠°', ' °'],
    ['⇀', '↼'],
    ['´• ', ' •`'],
    ['´', '`'],
    ['`', '´'],
    ['ó', 'ò'],
    ['ò', 'ó'],
    ['⸌', '⸍'],
    ['>', '<'],
    ['Ƹ̵̡', 'Ʒ'],
    ['ᗒ', 'ᗕ'],
    ['⟃', '⟄'],
    ['⪧', '⪦'],
    ['⪦', '⪧'],
    ['⪩', '⪨'],
    ['⪨', '⪩'],
    ['⪰', '⪯'],
    ['⫑', '⫒'],
    ['⨴', '⨵'],
    ['⩿', '⪀'],
    ['⩾', '⩽'],
    ['⩺', '⩹'],
    ['⩹', '⩺'],
    ['◥▶', '◀◤'],
    ['◍', '◎'],
    ['/͠-', '┐͡-\\'],
    ['⌣', '⌣”'],
    [' ͡⎚', ' ͡⎚'],
    ['≋'],
    ['૦ઁ'],
    ['  ͯ'],
    ['  ͌'],
    ['ළ'],
    ['◉'],
    ['☉'],
    ['・'],
    ['▰'],
    ['ᵔ'],
    [' ﾟ'],
    ['□'],
    ['☼'],
    ['*'],
    ['`'],
    ['⚆'],
    ['⊜'],
    ['>'],
    ['❍'],
    ['￣'],
    ['─'],
    ['✿'],
    ['•'],
    ['T'],
    ['^'],
    ['ⱺ'],
    ['@'],
    ['ȍ'],
    ['  '],
    ['  '],
    ['x'],
    ['-'],
    ['$'],
    ['Ȍ'],
    ['ʘ'],
    ['Ꝋ'],
    [''],
    ['⸟'],
    ['๏'],
    ['ⴲ'],
    ['◕'],
    ['◔'],
    ['✧'],
    ['■'],
    ['♥'],
    [' ͡°'],
    ['¬'],
    [' º '],
    ['⨶'],
    ['⨱'],
    ['⏓'],
    ['⏒'],
    ['⍜'],
    ['⍤'],
    ['ᚖ'],
    ['ᴗ'],
    ['ಠ'],
    ['σ'],
    ['☯']
]

MOUTHS = [
    ['v'],
    ['ᴥ'],
    ['ᗝ'],
    ['Ѡ'],
    ['ᗜ'],
    ['Ꮂ'],
    ['ᨓ'],
    ['ᨎ'],
    ['ヮ'],
    ['╭͜ʖ╮'],
    [' ͟ل͜'],
    [' ͜ʖ'],
    [' ͟ʖ'],
    [' ʖ̯'],
    ['ω'],
    [' ³'],
    [' ε '],
    ['﹏'],
    ['□'],
    ['ل͜'],
    ['‿'],
    ['╭╮'],
    ['‿‿'],
    ['▾'],
    ['‸'],
    ['Д'],
    ['∀'],
    ['!'],
    ['人'],
    ['.'],
    ['ロ'],
    ['_'],
    ['෴'],
    ['ѽ'],
    ['ഌ'],
    ['⏠'],
    ['⏏'],
    ['⍊'],
    ['⍘'],
    ['ツ'],
    ['益'],
    ['╭∩╮'],
    ['Ĺ̯'],
    ['◡'],
    [' ͜つ']
]

EARS = [
    ['q', 'p'],
    ['ʢ', 'ʡ'],
    ['⸮', '?'],
    ['ʕ', 'ʔ'],
    ['ᖗ', 'ᖘ'],
    ['ᕦ', 'ᕥ'],
    ['ᕦ(', ')ᕥ'],
    ['ᕙ(', ')ᕗ'],
    ['ᘳ', 'ᘰ'],
    ['ᕮ', 'ᕭ'],
    ['ᕳ', 'ᕲ'],
    ['(', ')'],
    ['[', ']'],
    ['¯\\_', '_/¯'],
    ['୧', '୨'],
    ['୨', '୧'],
    ['⤜(', ')⤏'],
    ['☞', '☞'],
    ['ᑫ', 'ᑷ'],
    ['ᑴ', 'ᑷ'],
    ['ヽ(', ')ﾉ'],
    ['\\(', ')/'],
    ['乁(', ')ㄏ'],
    ['└[', ']┘'],
    ['(づ', ')づ'],
    ['(ง', ')ง'],
    ['⎝', '⎠'],
    ['ლ(', 'ლ)'],
    ['ᕕ(', ')ᕗ'],
    ['(∩', ')⊃━☆ﾟ.*'],
]

TOSS = (
    "Heads",
    "Tails",
)

DECIDE = (
    "Yes.",
    "NoU.",
    "Maybe."
)

TABLE = (
    "(╯°□°）╯彡 ┻━┻",
    "I ran out of tables, will order more.",
    "Go do some work instead of flippin tables."
)
