import random
from telegram.ext import run_async, Filters
from telegram import Message, Chat, Update, Bot, MessageEntity
from tg_bot import dispatcher
from tg_bot.modules.disable import DisableAbleCommandHandler

KGF_STRINGS = (
      "പവർഫുൾ കോഴീസ് കമിങ് ഫ്രം പവർഫുൾ ഗ്രൂപ്പ്സ് 😌😌🤭🤭",  
      "മുറിവേറ്റ കോഴിയുടെ കൂവൽ ഗർജ്ജനത്തെക്കാൾ ഭയങ്കരമായിരുന്നു 😌😌🤭🤭", 
      "എല്ലാം ഗ്രൂപ്പിലും കോഴിയായി അങ്ങനെ ഒരാളുണ്ടാവുമല്ലോ നിങ്ങളെ കാണുമ്പോ ഞങ്ങൾക്കങ്ങനെ തോന്നുന്നു 😌😌🤭🤭", 
      "അവന്റെ കൂവൽ കേട്ട് പ്രപഞ്ചം പോലും വിറങ്ങലിച്ചു നിന്നു 😌😌🤭🤭", 
      "എട്ടു പേർക്ക് pm പോയാലാണ് ഒരാളെങ്കിലും എന്നെ മൈൻഡ് ആക്കുന്നത്. Pm ൽ ഉള്ളത് പോരാതെ ഗ്രൂപ്പിൽ വരുന്നവർക്കിടയിൽ ഇമ്മാതിരി കോഴിത്തരം കാണിക്കുന്ന നിന്റെ കഷ്ടപ്പാട് എനിക്ക് മനസ്സിലാവും 🤭🤭🤭😌😌", 
      "പ്രപഞ്ചത്തിൽ കോഴിയേക്കാൾ വലിയ പോരാളി മറ്റാരും തന്നെ ഇല്ല 😌😌🤭🤭", 
      "ഗാംഗുമായി വരുന്നവൻ റൂസ്റ്റർ അവൻ വന്നത് ഒറ്റക്കായിരുന്നു .... ---വൈൽഡ് റൂസ്റ്റർ 😌😌🤭🤭",
      "ആരെ വളക്കാനാണോ ഇവനെ വിളിപ്പിച്ചത് അവളെ കൂവി വളക്കാതെ ഇവൻ പോവില്ല.. ആ അവൾ ഏതാണെങ്കിലും ഏത് ഗ്രൂപ്പിലാണെങ്കിലും അവിടെ പോയി ഇവൻ വളക്കും 😌😌🤭🤭",
      "വിധി പോലും വിറച്ചു പോയി അവന്റെ കോഴിത്തരം കണ്ട് 😌😌🤭🤭",
      "നിന്റെ പിറകിൽ ആയിരം കോഴി ഉണ്ടെന്നുള്ള ധൈര്യം നിനക്കുണ്ടെങ്കിൽ നിനക്കൊരു പെണ്ണിനെ വളക്കാനാകും എന്നാൽ നീ മുന്നിൽ നിൽക്കുന്നുവെന്ന ധൈര്യം പുറകിൽ നിൽക്കുന്ന ആയിരം കോഴികൾക്കുണ്ടായാൽ ഈ TG നീ കീഴടക്കും 😌😌🤭🤭",
      "ആരെപ്പറ്റി ആലോചിച്ചും നീ തല പുണ്ണാക്കേണ്ട.. അവരാരും നിന്റെയത്ര കാട്ടു കോഴിയല്ല 😌😌🤭🤭", 
      "ഏതെങ്കിലും പത്തു പേരെ വളച്ചു കോഴിയായവനല്ല ഞാൻ ഞാൻ വളച്ച പത്തു പേരും പിടക്കോഴികളാ 😌😌🤭🤭", 
      "പേരിന്റെ കൂടെ ഓണർ വെച്ചവരൊന്നും ഓണർ ആവില്ല അഡ്മിൻ വെച്ചവരൊന്നും അഡ്മിനുമാകില്ല എന്റെ യോഗ്യതയെന്തെന്നാൽ ഞാൻ കൂവി വളച്ചവർക്കല്ലാതെ മാറ്റാർക്കുമറിയില്ല 😌😌🤭🤭", 

)


@run_async
def kgf(bot: Bot, update: Update):
    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages
    message = update.effective_message
    if message.reply_to_message:
      message.reply_to_message.reply_text(random.choice(KGF_STRINGS))
    else:
      message.reply_text(random.choice(KGF_STRINGS))

__help__ = """
- /kgf😌
"""

__mod_name__ = "kgf"

AYIN_HANDLER = DisableAbleCommandHandler("kgf",kgf)

dispatcher.add_handler(KGF_HANDLER)
