import random
from telegram.ext import run_async, Filters
from telegram import Message, Chat, Update, Bot, MessageEntity
from tg_bot import dispatcher
from tg_bot.modules.disable import DisableAbleCommandHandler

SFW_STRINGS = (
      "ഇവൾ നമ്മളേക്കാൾ തറയാടാ... 😇😇🤭",
      "നമ്മൾ നമ്മൾ പോലുമറിയാതെ അധോലോകം ആയി മാറിക്കഴിഞ്ഞിരിക്കുന്നു ഷാജിയേട്ടാ...😐",
      "എന്നെ ചീത്ത വിളിക്കു... വേണമെങ്കിൽ നല്ല ഇടി ഇടിക്കു... പക്ഷെ ഉപദേശിക്കരുത്.....😏",
      "ഓ ബ്ലഡി ഗ്രാമവാസീസ്!😡",
      "പോരുന്നോ എന്റെ കൂടെ!😜",
      "തള്ളെ കലിപ്പ് തീരണില്ലല്ലോ!!🤬",
      "എവിടെയാടാ നീ അടിച്ചോണ്ട് പോയ എന്റെ നീലക്കുയിൽ?? 😡🤣",
      "മോന്തയ്ക്കിട്ട് കൊടുത്തിട്ട് ഒന്ന് എടുത്ത് കാണിച്ചുകൊടുക്ക് അപ്പോൾ കാണും ISI മാർക്ക് 😑",
      "കണ്ണേട്ടാ ഇന്നാ നാരങ്ങാ മിട്ടായി.. 🥰🥰",
      "മധ്യതിരുവിതാംകൂർ ഭരിച്ച രാജാവാ പേര് ശശി 😎",
      "ഇത് ഞങ്ങളുടെ പണിസാധനങ്ങളാ രാജാവേ.🔨⛏",
      "കളിക്കല്ലേ കളിച്ചാൽ ഞാൻ തീറ്റിക്കുമെ പുളിമാങ്ങ....😎",
      "മ്മക്ക് ഓരോ ബിയറാ കാച്ചിയാലോ...🥂",
      "കള്ളടിക്കുന്നവനല്ലേ കരിമീനിന്റെ സ്വാദറിയു.....😋",
      "ഡാ വിജയാ നമുക്കെന്താ ഈ ബുദ്ധി നേരത്തെ തോന്നാതിരുന്നത്...!🙄",
      "ഇത്രേം കാലം എവിടെ ആയിരുന്നു....!🥰",
      "ദൈവമേ എന്നെ മാത്രം രക്ഷിക്കണേ....⛪",
      "എനിക്കറിയാം ഇവന്റെ അച്ഛന്റെ പേര് ഭവാനിയമ്മ എന്നാ....😂🤣🤣",
      "ഡാ ദാസാ... ഏതാ ഈ അലവലാതി.....😒",
      "ഒന്ന് മിണ്ടാതിരിക്കുവോ എന്റെ കോൺസെൻട്രേഷൻ പോണ് ദേ ആയുധം വെച്ചുള്ള കളിയാ",
      "മക്കളെ.. രാജസ്ഥാൻ മരുഭൂമിയിലേക്ക് മണല് കയറ്റിവിടാൻ നോക്കല്ലേ.....🥵",
      "ചങ്ക് പറിച്ചു തരുന്ന ചങ്കത്തി കൂടെയുള്ളപ്പോൾ പിന്നെന്തിനാ ലവർ 💪😍😍",
      "കാർ എൻജിൻ ഔട്ട് കംപ്ലീറ്റ്‌ലി.....🥵",
      "ഡോ ജോസെഫേ എന്തോന്നാടോ ഇത് 😇😇", 
      "ഗോ എവേ സ്റ്റുപ്പിഡ് ഇൻ ദി ഹൗസ് ഓഫ് മൈ വൈഫ്‌ ആൻഡ് ഡോട്ടർ യൂ വിൽ നാട്ട് സീ എനി മിനിറ്റ് ഓഫ് ദി റ്റുഡേ.. എറങ്ങിപ്പോടാ",
      "അവളെ ഓർത്ത് കുടിച്ച കള്ളും  നനഞ്ഞ മഴയും വേസ്റ്റ്....💔",
      "എന്നോട് പറ ഐ ലവ് യൂ ന്ന്....😘",
      "അല്ല ഇതാര് വാര്യംപിള്ളിയിലെ മീനാക്ഷി അല്ലയോ... എന്താ മോളെ സ്കൂട്ടറില്....🙈 ",
      "കിട്ടിയ  പെണ്ണും  കാട്ടിയ  പെണ്ണും കൂടെ ഇല്ലേലും ജനിപ്പിച്ച പെണ്ണ് കാണും ആജീവനാന്തം 🤰🤱👩‍👦",
  )

@run_async
def kill(bot: Bot, update: Update):
    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages
    message = update.effective_message
    if message.reply_to_message:
      message.reply_to_message.reply_text(random.choice(SFW_STRINGS))
    else:
      message.reply_text(random.choice(SFW_STRINGS))

__help__ = """
- /kill 😩
"""

__mod_name__ = "Kill"

KILL_HANDLER = DisableAbleCommandHandler("kill", kill)

dispatcher.add_handler(KILL_HANDLER)
