JINN_TEMPLATES = (
    "ഡാ ചൊറിത്തവളേ ",
    "നീ പോടാ മരമാക്രീ 😡😡🤬", 
    "വാടാ മരപ്പട്ടീ 😡😡",
    "എന്താണ്ടാ നിന്ന് ചെറയണേ 😡😡", 
    "എന്താടാ നിന്റെ നാവിറങ്ങിപ്പോയാ 😡😡", 
    "ധൈര്യണ്ടേൽ മുട്ടാൻ വാടാ.. 😡😡", 
    "അടിച്ചു നിന്റെ മണ്ട പൊളിക്കും ഞാൻ ", 
    "അടിച്ചു നിന്റെ മുപ്പത്തിരണ്ട് പല്ലും ഞാൻ കൊഴിക്കും ", 
    "തരത്തിൽ പോയി കളിക്കെടാ ചെക്കാ 😡😡", 
    "എന്താടാ നിന്റെ മുട്ട് വിറക്കുന്നുണ്ടോ 😡😡", 
    "ഇനി ഇമ്മാതിരി കോഴിത്തരോം കൊണ്ട് ഇവിടെ വന്നാൽ പൊന്നുമോനെ ഭിത്തിയേന്ന് വടിച്ചെടുക്കേണ്ടി വരും നിന്നെ..", 
)

JINN_SAITAMA_TEMPLATES = (
    "ചേട്ടനെ ഞാൻ ചീത്ത പറയില്ല 🥰🥰.",
    "ചേട്ടൻ എന്റെ മുത്താണ് 🥰🥰.",
    [
        "ചേട്ടാ സുഖല്ലേ 🥰🥰🥰🥰.",  # normal reply
        "ചേട്ടൻ സൂപ്പെറാ 🥰🥰😘😘.",  # reply to admin
        "tmute"  # command
    ]
)
