import random
from telegram.ext import run_async, Filters
from telegram import Message, Chat, Update, Bot, MessageEntity
from tg_bot import dispatcher
from tg_bot.modules.disable import DisableAbleCommandHandler

SFW_STRINGS = (
    "🎶 പൂമുത്തോളെ നീയെരിഞ്ഞ വഴിയില്‍ ഞാന്‍മഴയായി പെയ്തെടീ...ആരീരാരം ഇടറല്ലേ മണിമുത്തേ കണ്മണീ... 🎶",
    "🎶 തു മിലേ ദിൽ ഖിലേ ഓർ ജീനേ കോ ക്യാ ചാഹിയേ... 🎶", 
    "🎶 കുക്കുരു കുക്കു കുറുക്കൻ കക്കിരി കക്കും കറുമ്പൻ പണ്ടൊരു കാട്ടിലെത്തീ...🎶",
    "🎶 ഡിങ്കിരി ഡിങ്കിരി ഡിങ്കിരി ഡിങ്കിരി ഡിങ്കിരി പട്ടാളം ഡുമിക് ഡുമിക് ഡുമിക് ഡുമിക് ഡൂക്കിലി പട്ടാളം..🎶", 
    "🎶 പണ്ടു പണ്ടേ പൂത്ത മലരുകൾ മിന്നും മിന്നാമിനുങ്ങുകൾ ഒരു കുറി ഇനി വരുമോ... 🎶", 
    "🎶 മഴത്തുള്ളികൾ പൊഴിഞ്ഞീടുമീ നാടൻ വഴി... നനഞ്ഞോടിയെൻ കുടക്കീഴിൽ നീ വന്ന നാൾ... 🎶", 
    "🎶 നീയൊരു പുഴയായ് തഴുകുമ്പോൾ ഞാൻ പ്രണയം വിടരും കരയാവും... 🎶", 
    "🎶 അല്ലിമലർ കാവിൽ പൂരം കാണാൻ... അന്നു നമ്മൾ പോയി രാവിൽ നിലാവിൽ... 🎶", 
    "🎶 ജീവാംശമായ് താനേ നീ എന്നിൽ കാലങ്ങൾ മുന്നേ വന്നൂ... 🎶", 
    "🎶 ചന്ദനച്ചോലയിൽ മുങ്ങിനീരാടിയെൻ ഇളമാൻ കിടാവേ ഉറക്കമായോ... 🎶", 
    "🎶 അന്തിപ്പൊൻവെട്ടം കടലിൽ മെല്ലെത്താഴുമ്പോൾ... മാനത്തെ മുല്ലത്തറയില് മാണിക്യച്ചെപ്പ്... 🎶", 
    "🎶 താമരപ്പൂവിൽ വാഴും ദേവിയല്ലോ നീ... പൂനിലാക്കടവിൽ പൂക്കും പുണ്യമല്ലോ നീ... 🎶", 
    "🎶 കുന്നിമണിച്ചെപ്പു തുറന്നെണ്ണി നോക്കും നേരം, പിന്നിൽവന്നു കണ്ണു പൊത്തും കള്ളനെങ്ങു പോയി... 🎶", 
    "🎶 നീ ഹിമമഴയായ് വരൂ... ഹൃദയം അണിവിരലാൽ തൊടൂ... ഈ മിഴിയിണയിൽ സദാ പ്രണയം മഷിയെഴുതുന്നിതാ... 🎶", 
    "🎶 ഓടേണ്ട ഓടേണ്ടാ ഓടി തളരേണ്ടാ ഓമന പൂമുഖം വാടിടേണ്ടാ... 🎶", 
    "🎶 കറുകവയൽ കുരുവീ... മുറിവാലൻ കുരുവീ... തളിർ വെറ്റിലയുണ്ടോ... വരദക്ഷിണ വെക്കാൻ... 🎶", 
    "🎶 എള്ളോളം തരി പൊന്നെന്തിനാ തനി തഞ്ചാവൂര് പട്ടെന്തിനാ തങ്കം തെളിയണ പട്ടു തിളങ്ങണ ചന്തം നിനക്കാടീ... 🎶", 
    "🎶 മഞ്ഞൾ പ്രസാദവും നെറ്റിയിൽ ചാർത്തി... മഞ്ഞക്കുറിമുണ്ടു ചുറ്റി... 🎶", 
    "🎶 കറുത്തപെണ്ണേ നിന്നെ കാണാഞ്ഞിട്ടൊരു നാളുണ്ടേ... 🎶",
    "🎶 അയ്യയ്യോ പണി പാളീലോ രാരീരാരം പാടിയുറക്കാൻ ആരുമില്ലല്ലോ അയ്യയ്യോ പണി പാളീലോ രാരീരാരം പാടിയുറക്കാൻ ആരുമില്ലല്ലോ 🎶",
    "🎶 ചിങ്കാരകിന്നാരം ചിരിച്ചു കൊഞ്ചുന്ന മണിക്കുരുന്നേ വാ പുന്നാരം...പുന്നാരം...കുറുമ്പുറങ്ങുമീ കുരുന്നു ചുണ്ടത്തെ മണിപ്പതക്കം താ അമ്മാനം...അമ്മാനം...🎶", 
    "🎶 തൂമിന്നൽ തൂവൽ തുമ്പാൽ മെല്ലെ...എൻ പൂവൽ കനവിൽ തഴുകാൻ വരൂ...വാർത്തിങ്കൾ മായും രാവിൻ കൊമ്പിൽ...ചിറകേറി നീ ...പുലർ..വെയിൽ ...മലർ തരൂ...🎶", 
    "🎶 തൂമഞ്ഞു  വീണ  വഴിയേ വെൺ  തൂവൽ  വീശുമഴകേ ഇനിയെന്നുമെന്നും ഇതുപോലെ  നമ്മൾ കനവാർന്ന  സ്നേഹമഴയായ്... 🎶", 
    
  )

@run_async
def sing(bot: Bot, update: Update):
    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages
    message = update.effective_message
    if message.reply_to_message:
      message.reply_to_message.reply_text(random.choice(SFW_STRINGS))
    else:
      message.reply_text(random.choice(SFW_STRINGS))

__help__ = """
- /sing  ചില മലയാളം പാട്ടുകളുടെ ആദ്യ വരികൾ ലഭിക്കും.
"""

__mod_name__ = "Song Commands"

SING_HANDLER = DisableAbleCommandHandler("sing", sing)

dispatcher.add_handler(SING_HANDLER)
